/********************************Copyright (c)**********************************\
**
**                   (c) Copyright 2019, Main, China, Mrtutu.
**                           All Rights Reserved
**
**                                By Mrtutu
**                           Blog: www.mrtutu.cn
**
**----------------------------------文件信息------------------------------------
** @flie    : hc05.h
** @auther  : Mrtutu
** @date    : 2019-02-21
** @describe: 
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
\********************************End of Head************************************/
 
#ifndef __HC05_H_
#define __HC05_H_
#include "sys.h"

void HC05_Send_Encoders(int Encoder_A, int Encoder_B, int Encoder_C, int Encoder_D);
#endif

/********************************End of File************************************/